EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_Mintron/Interpret.c
/*
	This file are use for joystick control for SCD Engine

	Copyright BlueBird Aero Systems Ltd 2011
	http://www.bluebird-uav.com

	Revision 1.14  2012/02/21 09:13:50	EranS
	separate MINTRON/SCD project changes
	
*/


#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/timer.h"
#include "utils/uartstdio.h"
#include "driverlib/i2c.h"
#include "driverlib/interrupt.h"
#include "Interpret.h"
#include "comproc.h"
#include "Interpret.h"
#include "modeid.h"
#include "globals.h"
#include "reg.h"
#include "uart_echo.h"
#include "SysTick.h"
#include "A3906.h"
#include "rmb20d01.h"
#include "encoder.h"
#include "bluebird.h"


#define SENSORS_NUM 				 2u
#define GAIN_LEVEL_NUM				 4u
#define INPUTS_NUM 					 SENSORS_NUM
#define GAIN_SENS_NUM				 GAIN_LEVEL_NUM
#define SENSORS_MASK             	 0x000F

#define until(B) {volatile unsigned long long dd=0xffffffff; do{if(!B) break;}while(--dd);}

#define  FOVmin  4.5
#define  FOVmax  48
#define  VERTICAL_PROPORTION_TO_COMMAND 1
#define  HORIZONTAL_PROPORTION_TO_COMMAND 1
#define TXSIZE  20
#define MP_OK 1
#define MP_ERROR -1
#define BEYOND2PIX 4096.0f / 360.0f

//Roll
float A_HOR  = 0.220f;
float B_HOR  = 0.080f;

//Pitch
float A_SLOW_VER  = 0.00595;
float B_SLOW_VER  = 0.220f;

float A_FAST_VER  = 0.120f;
float B_FAST_VER  = 0.020f;

float g_fmaximum_ver_rate = 0;
float g_fmaximum_hor_rate = 0;

//float LOS_Roll_Pitch=0;

static int opt_zoom = 0;
//*****************************************************************************
//
// The value that is to be modified via bit-banding.
//
//*****************************************************************************
BYTE SensState[INPUTS_NUM] = {0};
BYTE GainLevelState[GAIN_SENS_NUM] = {0};

unsigned char g_sendBuffer[20];

tBoolean ignorejoystick = false;
tBoolean g_tbstabilizer = true;

static char Payload_corr=0; // for Mintron

static int DMCflag = 0;
static char g_curentmode = -1;
float  vertical,horizontal;
char Telemetry[16];
//char Payload_type=14;
//char Payload_type=7; // For IR Golden
char Payload_type=8; // for Mintron

//bTelemBlock m_bTelemBlock;
extern unsigned short DMCmode;
extern ctrl_type ctrl;
extern BYTE	Stabilize_status;
extern LabelCmd LabelCmdMsg[MAX_LABEL_LENGTH];
extern float omega_vertical,omega_horizontal;  
extern float pitchangle;
extern float Phic,Thetac;
extern unsigned short target_pos;
extern unsigned short Agc_level;
extern unsigned short Sens_level;

extern MINTRON_TXRX_S LensZoomWrite;
extern MINTRON_TXRX_S AgcSensLevel;


const ZoomPosition FrameArray[13] = {
//Width,Height,BlockNumX,BlockNumY,BlockNum,BlkWidthPwr,BlkBandPwr,Reserve
{ 0x1000,  0x108F, 45.0f }, // Z1
{ 0x1090,  0x110F, 40.0f}, // Z1.2
{ 0x1110,  0x11CF, 35.0f}, // Z1.5
{ 0x11D2,  0x12A6, 30.0f}, // Z2
{ 0x12A8,  0x132F, 24.0f}, // Z3
{ 0x1330,  0x1367, 22.0f}, // Z4
{ 0x1368,  0x13AF, 20.0f}, // Z5
{ 0x13B0,  0x13EF, 18.0f}, // Z6
{ 0x13F0,  0x1427, 16.0f}, // Z7
{ 0x1428,  0x1447, 14.0f}, // Z8
{ 0x1448,  0x1457, 12.0f}, // Z9
{ 0x1458,  0x1456, 10.0f }  // Z10
};

void InitSens(void)
{
  HWORD i;

 for(i=0; i<INPUTS_NUM; i++)
     SensState[i] = 0;
 
}

void InitGainLevel(void)
{
  HWORD i;

 for(i=0; i<GAIN_SENS_NUM; i++)
		GainLevelState[i] = 0;
 
}


/*
 * FUNCTION: SensorDebounce - Perform the debouncing sensor algorithm
 * DESCRIPTION: SensState[i] keep the previouse samples of the sensors state
 *               in a FIFO shift register 
 */
void SensorDebounce(unsigned char* msg)
{
   unsigned short i, s, frs;

   frs = msg[6];

   if( frs & 0x3)
   {	   	      
	   frs &= SENSORS_MASK;   
	   
	   for(i=0; i<INPUTS_NUM; i++, frs >>= 1)
	   {
	     s = (unsigned short)SensState[i] << 1;
	     s |= frs & 1;
	     SensState[i] = (unsigned char)(s & 0x1F);
	   }
   }
   else
	InitSens();
   	
}



/*
 * FUNCTION: SensorDebounce - Perform the debouncing sensor algorithm
 * DESCRIPTION: SensState[i] keep the previouse samples of the sensors state
 *               in a FIFO shift register 
 */
void GainDebounce(unsigned char* msg)
{
   unsigned short i, s, frs;

   frs = msg[5];

   if( frs & 0xF)
   {	   	      
	   frs &= SENSORS_MASK;   
	   
	   for(i=0; i<GAIN_LEVEL_NUM; i++, frs >>= 1)
	   {
	     s = (unsigned short)GainLevelState[i] << 1;
	     s |= frs & 1;
	     GainLevelState[i] = (unsigned char)(s & 0x3);
	   }
   }
   else
	InitGainLevel();
   	
}


/*
 *               New Full Majority Table
 *
 * Bit wise Majority  table: '1' - more '1' than '0'
 *                           '0' - more '0' than '1'
 *                           '-1'- num('0') == num('1') 
 */
const unsigned short MajorityTab[256] = {	
 0, 1,-1,-1,-1, 0, 1,-1,-1, 0, 0, 0, 1, 0, 1,-1,
-1, 0, 0, 0, 0, 0, 0,-1, 1, 0, 0,-1, 1,-1,-1, 1, 
 0, 0, 0, 0, 0, 0, 0,-1, 0, 0, 0,-1, 0,-1,-1, 1, 
-1, 0, 0,-1, 0,-1,-1, 1, 1,-1,-1, 1,-1, 1, 1, 1, 
 0, 0, 0, 0, 0, 0, 0,-1, 0, 0, 0,-1, 0,-1,-1, 1, 
 0, 0, 0,-1, 0,-1,-1, 1, 0,-1,-1, 1,-1, 1, 1, 1, 
 0, 0, 0,-1, 0,-1,-1, 1, 0,-1,-1, 1,-1, 1, 1, 1, 
-1,-1,-1, 1,-1, 1, 1, 1,-1, 1, 1, 1, 1, 1, 1, 1, 
 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1, 0,-1,-1,-1, 
 0, 0, 0,-1, 0,-1,-1, 1, 0,-1,-1, 1,-1, 1, 1, 1, 
 0, 0, 0,-1, 0,-1,-1, 1, 0,-1,-1, 1,-1, 1, 1, 1, 
 0,-1,-1, 1,-1, 1, 1, 1,-1, 1, 1, 1, 1, 1, 1,-1, 
 0, 0, 0, 0, 0,-1,-1, 0, 0,-1,-1, 1,-1, 1, 1,-1, 
 0,-1,-1, 1,-1, 1, 1, 1,-1, 1, 1, 1, 1, 1, 1,-1, 
 0, 0,-1, 0,-1, 1, 1, 0,-1, 1, 1, 1, 1, 1, 1,-1,
-1, 0, 1, 0, 0, 1, 1,-1,-1, 0, 1,-1,-1,-1, 0, 1};

/*
 * FUNCTION: GetSensorState - Returns the sensors state after the debounce filter
 *           based on majority table.
 */
unsigned short GetSensorState(void)
{
   static unsigned short state = 0;
   unsigned short i,f;
   signed short db;
   for (i=0,f=1; i< INPUTS_NUM; i++, f<<=1)
   {
      db = (signed short)MajorityTab[SensState[i]];
      if(db > 0) // More 1's than 0's
         state |= f;
      else
      if(db == 0) // More 0' than 1's
         state &= ~ f;
    }

    return state; 
}


