EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_Mintron/Interpret.c
unsigned int GetDMCflag(unsigned int mask)
{
   return (DMCflag & mask);
}

void SetDMCflag(unsigned int mask, unsigned int val)
{
   DMCflag &= ((~mask) | val);
   DMCflag |= (mask & val); 
}


//*****************************************************************************
//
// Send a string to the UART.
//
//*****************************************************************************
void
UART0SendDataBlock(unsigned char *pucBuffer, unsigned ulCount)
{
    //
    // Loop while there are more characters to send.
    //
    while(ulCount--)
    {
        //
        // Write the next character to the UART.
        //
        UARTCharPut(UART0_BASE,*pucBuffer++);
	
    }
}


void ReportData()
{


	//static int num = 0;
	int checksum,i;
	float Roll_Report,Pitch_Report;
	float tmpPhic=0,tmpThetac=0;
	int temp = 0;
	float Los_Roll=0.0f;

	Los_Roll = (Phic * RAD2DEG);
	Los_Roll *= BEYOND2PIX;

	//tmpPhic = Motor[ROLL_MOTOR].aangle; // (Phic * RAD2DEG);
	Roll_Report = Motor[ROLL_MOTOR].aangle; // (Phic * RAD2DEG);;
	Roll_Report *= BEYOND2PIX;

	//tmpThetac= Motor[PITCH_MOTOR].aangle; // (Thetac* RAD2DEG);	
	Pitch_Report = Motor[PITCH_MOTOR].aangle; // (Thetac* RAD2DEG);	;
	Pitch_Report*=BEYOND2PIX;
		
	g_sendBuffer[0] = 0xb0; //0xb0;
	g_sendBuffer[1] = 0x3b;
	g_sendBuffer[2] = 0x4f;

	g_sendBuffer[3] = 0;//num++ & 0xFF;				//STATUS W0  - TBD by Bluebird
	g_sendBuffer[4] = 0;				// STATUS W1- TBD by Bluebird			// erez    ????
	temp = 0;
	if(!GetDMCflag(DMC_EXE_MODE))
		temp |= 0x1;

	temp |= ((g_curentmode<<2) & 0x7C);

	g_sendBuffer[5] = temp;				// D0: payload is free to accept commands D1: 0- there are no payload fails
	g_sendBuffer[6] = 0;				// R for NUCps	spare	R for AGC ROIps	Iris Reportps

	temp = 0;	

	// D1: 1 == Payload Ready
	if( GetDMCflag(DMC_ENGINE_CONNECT)) // D6: Hot Blk/Wht Rptps
		temp |= 0x02;
	
	g_sendBuffer[7] = ((0x4) | temp); // D1: 1- payload has completed initialization process; D2: 1- camera is using electronic zoom
	
	//g_sendBuffer[8] =  ((int)(38.67f-(FrameArray[opt_zoom].FOV2Deg))/18.4)*129;
	g_sendBuffer[8] =  ((int)(-4.2448f*FrameArray[opt_zoom].FOV2Deg))+51.591f;
	
	g_sendBuffer[9] = ((int)Pitch_Report & 0xFF); // Pitch Report LSB 0-7 Bit
	//Pitch_Report_MSb = ((Pitch_Report >> 8) & 0x0F);
	g_sendBuffer[10] = Payload_type<<4 | (((int)Pitch_Report >> 8) & 0x0F);	
	
 	g_sendBuffer[11] = ((int)Roll_Report & 0xFF); 			// Roll_Report_LSB 0-7 Bit;
	g_sendBuffer[12] = ((int)Roll_Report >> 8) & 0x0F; 			// Roll_Report_LSB 0-3 Bit;

	g_sendBuffer[13] = Payload_corr;

 	//g_sendBuffer[14] = 0;//((int)LOS_Roll_Pitch & 0xFF); 			// Roll_Report_LSB 0-7 Bit;
	//g_sendBuffer[15] = 0;//((int)LOS_Roll_Pitch >> 8) & 0x0F; 			// Roll_Report_LSB 0-3 Bit;

	//g_sendBuffer[16] = ((int)Los_Roll & 0xFF); ;
	//g_sendBuffer[17] = ((int)Los_Roll >> 8) & 0x0F;

	//g_sendBuffer[14] = ((int)LOS_Roll_Pitch >> 24) & 0xFF; 			// LOS Roll_Report;
 	//g_sendBuffer[15] = ((int)LOS_Roll_Pitch >> 16) & 0xFF; 			
	//g_sendBuffer[16] = ((int)LOS_Roll_Pitch >> 8) & 0xFF;			
 	//g_sendBuffer[17] = ((int)LOS_Roll_Pitch) & 0xFF; 	

	for (checksum = 0,i=0;i<(18);i++)
		checksum+=g_sendBuffer[i];
	g_sendBuffer[19] = checksum % 256;

	/* write the users command out the serial port */
 	UART0Send(g_sendBuffer, 20);	
 }

void ObservationMode(unsigned char* msg)
{
int cmd;
//unsigned char len=2;	
//float tmpPhic=0,tmpThetac=0;


	/*Payload Pitch and Roll  Rate Command to calculate the pixel 
	location of the center of the required video image
	Pitch (vertical) 0.5 [rad/sec] = 1000 Pixels/Sec
	Roll (Horizontal) 1[rad/sec] = 2000 pixels/Sec
	For every video frame, Update the center of the FOV by 
	these rates multiplied by the command range as defined in Byte 13 & 14:
	*/
	/*Byte 13
	D0-D7	
	Vertical rate command in camera coordinate system. 
	Together with Byte 8/D0-D1 determines 10 bit unsigned command. 
	The payload response to a command in the allowed range of [0..1023] is  
	given by:  max_rate*(command-512)/511  
	Command of 512 --> 0 rate
	Positive command --> line of sight moves upward
	In Point Coordinate mode this command moves target position 
	data by an offset proportional to command.
	In Hold Coordinate mode this command moves holding coordinates 
	at a rate proportional to command.
	*/
	//printf("Interpret - ObservationMode()@%d \n",__LINE__);   //debug
	//Roll_Rate = ((Data[7] & 0xF)<<2) +  ((Data[8] & 0xC)>>2);   
	//Pitch_Rate = ((Data[8] & 0xF)<<2) +  (Data[11] & 0x3); 

	//printf(" 0x%08X 0x%08X\n",*vertical,*horizontal); 

	cmd = (int)((int)(msg[16]<<2) + (msg[11] & 0x3));
	//vertical = VERTICAL_PROPORTION_TO_COMMAND*(512-cmd)/4;		// Nissim  /511 ; 
	vertical = (float)g_fmaximum_ver_rate*((((float)cmd-512.0f)/511.0f));		//Nissim  /511  ;

	//horizontal = HORIZONTAL_PROPORTION_TO_COMMAND * (512-cmd)/4;		//Nissim  /511  ;
	/*
	Byte 14
	D0-D7	
	Horizontal rate command in camera coordinate system. 
	Together with Byte 8/D2-D3 determines 10 bit unsigned command. 
	The payload response to a command in the allowed range of [0..1023] is  
	given by:  max_rate*(command-512)/511  
	Command of 512 --> 0 rate
	Positive command --> line of sight moves to the left.
	In Point Coordinate mode this command moves target position data by an offset proportional to command.
	In Hold Coordinate mode this command moves holding coordinates at a rate proportional to command.
	*/
	cmd = (int)((int)(msg[17]<<2) + ((msg[11])>>2 & 0x3));
	//vertical = VERTICAL_PROPORTION_TO_COMMAND*(512-cmd)/4;		// Nissim  /511 ; 
	//horizontal = HORIZONTAL_PROPORTION_TO_COMMAND * (512-cmd)/4;		//Nissim  /511  ;
	horizontal = (float)g_fmaximum_hor_rate*(((float)cmd-512.0f)/511.0f);		// Nissim  /511 ; 
}

int PointCoordinateMode(unsigned char* msg)
{
	if(GetDMCmode() == ONLINE_STATE)
	{
	
		if( (!GetDMCflag(DMC_POINT_2_COORD)) || (!GetDMCflag(DMC_EXE_MODE)) )					
			{					
	
				SetDMCflag(DMC_POINT_2_COORD,DMC_POINT_2_COORD);							
				SetDMCflag(DMC_CAM_GUIDE | DMC_STOW | DMC_PILOT_WINDOW | DMC_RATE | DMC_PTC_CG,0);								
				
				SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);
	
				if(GetDMCflag(DMC_OSD_ON))
				{								
					Set_OSD_Titel(4);			
					cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
				}		
				
				return POINT_COORDINATE_MODE;
			}				
	}

	return -1;

