EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_Mintron/Interpret.c
}

int HoldCoordinateMode(unsigned char* msg)
{
	if(GetDMCmode() == ONLINE_STATE)
	{				
		if( (!GetDMCflag(DMC_RATE)) || (!GetDMCflag(DMC_EXE_MODE)) )	
		{
			SetDMCflag(DMC_RATE,DMC_RATE);						
			SetDMCflag(DMC_STOW | DMC_PILOT_WINDOW | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG ,0);																									
	
			SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

			g_tbstabilizer = true;			
			ignorejoystick = false; 						
			omega_vertical = (Thetac * RAD2DEG);		
			omega_horizontal = (Phic * RAD2DEG);		
			
			MotorBrakePositionClean(PITCH_MOTOR);
			MotorBrakePositionClean(ROLL_MOTOR);
			
			if(GetDMCflag(DMC_OSD_ON))
			{										
				Set_OSD_Titel(8);			
				cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
			}
			
			return HOLD_COORDINATE_MODE;				
		}
		
	}					

	return -1;

}

int RateMode(unsigned char* msg)
{
	g_tbstabilizer = true;			

	if(GetDMCmode() == ONLINE_STATE)
	{				
		if( (!GetDMCflag(DMC_RATE)) || (!GetDMCflag(DMC_EXE_MODE)) )	
		{
			SetDMCflag(DMC_RATE,DMC_RATE);						
			SetDMCflag(DMC_STOW | DMC_PILOT_WINDOW | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG ,0);																									
	
			SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

			g_tbstabilizer = true;			
			ignorejoystick = false; 
			
			omega_vertical = (Thetac * RAD2DEG);		
			omega_horizontal = (Phic * RAD2DEG);		
			
			MotorBrakePositionClean(PITCH_MOTOR);
			MotorBrakePositionClean(ROLL_MOTOR);
						
			if(GetDMCflag(DMC_OSD_ON))
			{										
				Set_OSD_Titel(1);			
				cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
			}
			
			return OBSERVATION_MODE;				
		}
		
	}					

	return -1;
}

int PilotWindowMode(unsigned char* msg)
{

	if(GetDMCmode() == ONLINE_STATE)
	{
		if(!GetDMCflag(DMC_PILOT_WINDOW) || (!GetDMCflag(DMC_EXE_MODE)) )
		{
						
			SetDMCflag(DMC_PILOT_WINDOW,DMC_PILOT_WINDOW);	// signal for control center			
			SetDMCflag(DMC_STOW | DMC_RATE | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG,0); 																

			SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

			g_tbstabilizer = false;	  
			ignorejoystick = true;		

			EncoderInit2Point(PITCH_MOTOR,A3906_FORWARD,Motor[PITCH_MOTOR].max_position);		  
			EncoderInit2Point(ROLL_MOTOR,A3906_FORWARD,Motor[ROLL_MOTOR].zero_pos); // SCD Engine encoder 360

			//EncoderWhile2Point(PITCH_MOTOR,A3906_FORWARD,Motor[PITCH_MOTOR].max_position);
			//EncoderWhile2Point(ROLL_MOTOR,A3906_REVERSE,Motor[ROLL_MOTOR].avg_position);
			
			if(GetDMCflag(DMC_OSD_ON))
			{			
				Set_OSD_Titel(3);			
				cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
			}
			
			return PILOT_WINDOW_MODE;
		}
		
	}		
	
	return -1;
}



int SafeMode(unsigned char* msg)
{

	if(GetDMCmode() == ONLINE_STATE)
	{
		if(!GetDMCflag(DMC_STOW) || (!GetDMCflag(DMC_EXE_MODE)) )
		{
			SetDMCflag(DMC_STOW,DMC_STOW);		
			SetDMCflag(DMC_PILOT_WINDOW | DMC_RATE | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG,0); // signal for control center		
			
			SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

			ignorejoystick = true;	  
			g_tbstabilizer = false;						

			//EncoderInitReset(QEI0_BASE,PITCH_MOTOR,A3906_REVERSE);	// J6 PITCH Encoder  
			//EncoderInitReset(QEI1_BASE,ROLL_MOTOR,A3906_FORWARD); // J8 ROLL Encoder  

			
			EncoderInit2Point(PITCH_MOTOR,A3906_FORWARD,1);		  
			EncoderInit2Point(ROLL_MOTOR,A3906_FORWARD,1); // SCD Engine encoder 360			

			if(GetDMCflag(DMC_OSD_ON))
			{
				Set_OSD_Titel(2);			
				cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
			}
			
			return SAFE_MODE;
		}
	}
	
	return -1;
}


void Osd_Show(unsigned char* msg)
{
 	unsigned short cmd;
 	//unsigned short idx = 1;
 	//unsigned short i = 0;
	//int id = 0;

 		cmd = (msg[3] & 0x40);
	
		switch(cmd)
		{

			case 0x0:

					if(GetDMCmode() == ONLINE_STATE)
					{
						if( GetDMCflag(DMC_OSD_ON) || (!GetDMCflag(DMC_EXE_MODE)) ) // OSD OFF
						{
							SetDMCflag(DMC_OSD_ON,0);																
							ctrl.time[TIME_ZOOM] = GetSysTickCount();														
							putDMCmode(SET_OSD_OFF);	
						}
					}

			break;

			case 0x40:

					if(GetDMCmode() == ONLINE_STATE)
					{
						if( (!GetDMCflag(DMC_OSD_ON)) || (!GetDMCflag(DMC_EXE_MODE)) ) // OSD ON
						{
							SetDMCflag(DMC_OSD_ON,DMC_OSD_ON);	
							ctrl.time[TIME_ZOOM] = GetSysTickCount();	
							putDMCmode(SET_OSD_ON);		
						}
					}

			break;

		
			default:

			break;
			
			}
}

void Mark_Show(unsigned char* msg)
{
 		unsigned short cmd;

 		cmd = (msg[3] & 0x20);
	
		switch(cmd)
		{

			case 0x0:

					if(GetDMCmode() == ONLINE_STATE)
					{
						if( GetDMCflag(DMC_MARK_CROOS) || (!GetDMCflag(DMC_EXE_MODE)) ) // MARK OFF
						{
	 						SetDMCflag(DMC_MARK_CROOS,0);	
							SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

							LensZoomWrite.data[0]=0x0; //																		
							LensZoomWrite.data[1]=0x0; // mark off
							LensZoomWrite.data[12]=0x1; //
							memset(&LensZoomWrite.data[2],0,10);
							cpPutMessage(UART1_BASE,0x56,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
						}
					}

			break;

			case 0x20:

					if(GetDMCmode() == ONLINE_STATE)
					{
						if( !GetDMCflag(DMC_MARK_CROOS) || (!GetDMCflag(DMC_EXE_MODE)) ) // MARK ON
						{
							SetDMCflag(DMC_MARK_CROOS,DMC_MARK_CROOS);	
							SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

							LensZoomWrite.data[0]=0x0; // mark off												
							LensZoomWrite.data[1]=0x1; // mark on					
							LensZoomWrite.data[12]=0x1; // mark off						
							memset(&LensZoomWrite.data[2],0,10);												
							cpPutMessage(UART1_BASE,0x56,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
						}
					}

			break;

		
			default:

			break;
			
			}
}

// Interpreting the data of the mode
void InterpretCmdMode(unsigned char *bdData1)
{	
	char mode = bdData1[3] & 0x0F;

	if(GetDMCflag(DMC_ENGINE_CONNECT))
	{
		if(g_curentmode != mode)
		{
			if ( mode == OBSERVATION_MODE) // 0
				g_curentmode = RateMode(bdData1);
			else if ( mode == HOLD_COORDINATE_MODE) // 2
				g_curentmode = HoldCoordinateMode(bdData1);
			else if ( mode == POINT_COORDINATE_MODE) //1//
				g_curentmode = PointCoordinateMode(bdData1);			
			else if ( mode == PILOT_WINDOW_MODE) //3// 
				g_curentmode = PilotWindowMode(bdData1);
			else if ( mode == SAFE_MODE) //4// 
				g_curentmode = SafeMode(bdData1);
			//else if ( mode == BIT_MODE) //10
				//g_curentmode = BitMode(bdData1);
			
