EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_Mintron/Interpret.c
		}
		
		ObservationMode(bdData1);


	}
}


void SetBitMode(void)
{
    unsigned long start;		


	target_pos = E_MAX_ZX10;	
	ZoomFovCalculation();
	g_fmaximum_ver_rate = A_FAST_VER*FrameArray[opt_zoom].FOV2Deg+B_FAST_VER;
	g_fmaximum_hor_rate = A_HOR*FrameArray[opt_zoom].FOV2Deg+B_HOR; 									
	memset(&LensZoomWrite.data,0,13);	
	LensZoomWrite.write = 0x21;
	LensZoomWrite.data[1]=HIBYTE(target_pos);	//	0x00~0xFF(ZOOM target position HIGH BYTE)
	LensZoomWrite.data[2]=LOBYTE(target_pos);	//	0x00~0xFF(ZOOM target position LOW BYTE)	
	cpPutMessage(UART1_BASE,0x45,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);							
			
	start = GetSysTickCount();
	while ((GetSysTickCount() - start) < 3000);   // encoder samples at 500Hz, we check at 10Hz


	target_pos = MINI_ZOOM;	
	ZoomFovCalculation();
	g_fmaximum_ver_rate = A_FAST_VER*FrameArray[opt_zoom].FOV2Deg+B_FAST_VER;
	g_fmaximum_hor_rate = A_HOR*FrameArray[opt_zoom].FOV2Deg+B_HOR; 									
	memset(&LensZoomWrite.data,0,13);	
	LensZoomWrite.write = 0x21;
	LensZoomWrite.data[1]=HIBYTE(target_pos);	//	0x00~0xFF(ZOOM target position HIGH BYTE)
	LensZoomWrite.data[2]=LOBYTE(target_pos);	//	0x00~0xFF(ZOOM target position LOW BYTE)	
	cpPutMessage(UART1_BASE,0x45,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);							
			
	start = GetSysTickCount();
	while ((GetSysTickCount() - start) < 3000);   // encoder samples at 500Hz, we check at 10Hz
	
	Set_OSD_Titel(0xE); 		
			
	LensZoomWrite.write = 0x21;
	LensZoomWrite.data[0]=0x1;	//	
	LensZoomWrite.data[1]=0x0;	// 0x01 (n=11:character 11 ~ 15)		   
			
	LensZoomWrite.data[2] = 0;
	LensZoomWrite.data[4] = 0;	
	LensZoomWrite.data[6] = 0;	
	LensZoomWrite.data[8] = 0;	
	LensZoomWrite.data[10] = 0; 	
	cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  

	EncoderWhile2Point(PITCH_MOTOR,A3906_FORWARD,Motor[PITCH_MOTOR].relative);
	EncoderWhile2Point(ROLL_MOTOR,A3906_REVERSE,Motor[ROLL_MOTOR].relative);
					
	Motor[PITCH_MOTOR].zero_pos = QEIPositionGet(QEI0_BASE);
	Motor[ROLL_MOTOR].zero_pos = QEIPositionGet(QEI1_BASE);

	/*------------------------------------------------------------*/
	/* BMA180GetXYZ() time is 30~ microsecond						   */
	/*------------------------------------------------------------*/				
	BMA180GetXYZ(); 				
	/*------------------------------------------------------------*/
	/* AHRS() time is 25~ microsecond										 */
	/*------------------------------------------------------------*/					
	AHRS();

	SetRelativeInertial();

}

void ZoomFovCalculation(void)
{
	int i = 0;

	for(i=0;i<13;i++)
		if((target_pos >= FrameArray[i].StartZoom) && (target_pos <= FrameArray[i].EndZoom) )
		{
			opt_zoom = i;
			break;
		}

}
	
float  FOV_command(int command)
{
/* Linear from widest FOV (0) to narrowest optical FOV (15). Does not include electronic zoom range. 
 FOVmin = 4.5?, FOVmax = 48?
 FOVcmd =FOVmax+ command X  (FOVmin-FOVmax)/15

*/
float FOVcmd , step=(FOVmax-FOVmin)/15;

FOVcmd = FOVmax - step;

//printf("Interpret - FOV_command()@%d \n",__LINE__);

return FOVcmd;
}

void UavLatitude(unsigned char* msg)
{
	unsigned short cmd;
	unsigned short mode;	
	unsigned short idx = 1;
	unsigned short i = 0;
	
		cmd = (msg[6] & 0x03);
		
		switch(cmd)
		{

			case 0x01: // ZOOM OUT

					if(GetDMCmode() == ONLINE_STATE)
					{
						if(target_pos-SensState[0] > MINI_ZOOM) 								
						{
							target_pos-=SensState[0];	
							ZoomFovCalculation();
							g_fmaximum_ver_rate = A_FAST_VER*FrameArray[opt_zoom].FOV2Deg+B_FAST_VER;
							g_fmaximum_hor_rate = A_HOR*FrameArray[opt_zoom].FOV2Deg+B_HOR;							
							memset(&LensZoomWrite.data,0,13);
							LensZoomWrite.write = 0x21;
							LensZoomWrite.data[1]=HIBYTE(target_pos);	//	0x00~0xFF(ZOOM target position HIGH BYTE)
							LensZoomWrite.data[2]=LOBYTE(target_pos);	//	0x00~0xFF(ZOOM target position LOW BYTE)	
							cpPutMessage(UART1_BASE,0x45,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);
						}
						else
						{
							target_pos = MINI_ZOOM;
							ZoomFovCalculation();
							g_fmaximum_ver_rate = A_FAST_VER*FrameArray[0].FOV2Deg+B_FAST_VER;
							g_fmaximum_hor_rate = A_HOR*FrameArray[0].FOV2Deg+B_HOR;							
							
							memset(&LensZoomWrite.data,0,13);	
							LensZoomWrite.write = 0x21;
							LensZoomWrite.data[1]=HIBYTE(target_pos);	//	0x00~0xFF(ZOOM target position HIGH BYTE)
							LensZoomWrite.data[2]=LOBYTE(target_pos);	//	0x00~0xFF(ZOOM target position LOW BYTE)	
							cpPutMessage(UART1_BASE,0x45,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);							
						}						
					}					
	
				
				break;
				
				case 0x02: // ZOOM IN

					if(GetDMCmode() == ONLINE_STATE)
					{				

						if(target_pos+SensState[1] < MAX_ZOOM)					
						{					
							target_pos+=SensState[1];							
							ZoomFovCalculation();
							g_fmaximum_ver_rate = A_FAST_VER*FrameArray[opt_zoom].FOV2Deg+B_FAST_VER;
							g_fmaximum_hor_rate = A_HOR*FrameArray[opt_zoom].FOV2Deg+B_HOR;							
							memset(&LensZoomWrite.data,0,13);							
							LensZoomWrite.write = 0x21;
							LensZoomWrite.data[1]=HIBYTE(target_pos);	//	0x00~0xFF(ZOOM target position HIGH BYTE)
							LensZoomWrite.data[2]=LOBYTE(target_pos);	//	0x00~0xFF(ZOOM target position LOW BYTE)	
							cpPutMessage(UART1_BASE,0x45,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);							
						}
						else
						{
							target_pos = MAX_ZOOM;		
							ZoomFovCalculation();
							g_fmaximum_ver_rate = A_FAST_VER*FrameArray[11].FOV2Deg+B_FAST_VER;
							g_fmaximum_hor_rate = A_HOR*FrameArray[11].FOV2Deg+B_HOR;							
							
							memset(&LensZoomWrite.data,0,13);		
							LensZoomWrite.write = 0x21;
							LensZoomWrite.data[1]=HIBYTE(target_pos);	//	0x00~0xFF(ZOOM target position HIGH BYTE)
							LensZoomWrite.data[2]=LOBYTE(target_pos);	//	0x00~0xFF(ZOOM target position LOW BYTE)								
							cpPutMessage(UART1_BASE,0x45,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);		
							
						}
						
					}									
				
				break;
				
			
