EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_Mintron/Interpret.c
			#if 0
			case 0x04: // Camera Guide Mode
				
				if((mode == 0x0C)) // PTC Mode Point To Koordenet
				{
					if(GetDMCmode() == ONLINE_STATE)
					{
				
							if( !GetDMCflag(DMC_POINT_2_COORD) ||!GetDMCflag(DMC_EXE_MODE) )					
							{					

								SetDMCflag(DMC_POINT_2_COORD,DMC_POINT_2_COORD);							
								SetDMCflag(DMC_CAM_GUIDE | DMC_STOW | DMC_PILOT_WINDOW | DMC_RATE | DMC_PTC_CG,0);								
								
								SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

								if(GetDMCflag(DMC_OSD_ON))
								{								
									Set_OSD_Titel(4);			
									cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
								}								
								
							}
								
					}
				}
				else
				{
 					if(mode == 0x4) 					
					{
						if(cmd)	// CG
						{
								if(GetDMCmode() == ONLINE_STATE)
								{
							
									if( (!GetDMCflag(DMC_CAM_GUIDE)) || (!GetDMCflag(DMC_EXE_MODE)) )				
									{
										SetDMCflag(DMC_CAM_GUIDE,DMC_CAM_GUIDE);									
										SetDMCflag(DMC_POINT_2_COORD | DMC_STOW | DMC_PILOT_WINDOW | DMC_RATE | DMC_PTC_CG,0);

										SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

										if(GetDMCflag(DMC_OSD_ON))
										{									
											Set_OSD_Titel(5);			
											cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
										}					
									}													
									
								}
								
						}
 					}
				
				}
				
			break;

			case 0x08: // Point To Koordenet

				if((mode == 0x0C)) // PTC Mode
				{
						if(GetDMCmode() == ONLINE_STATE)
						{
				
							if( (!GetDMCflag(DMC_POINT_2_COORD)) || (!GetDMCflag(DMC_EXE_MODE)) )					
							{					

								SetDMCflag(DMC_POINT_2_COORD,DMC_POINT_2_COORD);							
								SetDMCflag(DMC_CAM_GUIDE | DMC_STOW | DMC_PILOT_WINDOW | DMC_RATE | DMC_PTC_CG,0);								
								
								SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);

								if(GetDMCflag(DMC_OSD_ON))
								{								
									Set_OSD_Titel(4);			
									cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
								}
							}													
						}


				}
				else
				if(cmd) // PTC+CG Mode
				{
 					if(mode == 0x8)
 					{
						if(GetDMCmode() == ONLINE_STATE)
						{						
							if((!GetDMCflag(DMC_PTC_CG)) || (!GetDMCflag(DMC_EXE_MODE)) )				
							{					
								SetDMCflag(DMC_PTC_CG,DMC_PTC_CG);															
								SetDMCflag(DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_STOW | DMC_RATE | DMC_PILOT_WINDOW ,0);								
								
								SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);
								if(GetDMCflag(DMC_OSD_ON))
								{								
									Set_OSD_Titel(6);			
									cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
								}				
							}			
							
						}		
 					}
				}
				
			break;
			
			case 0x10: 
					
				if(cmd)
				{			
					if(GetDMCmode() == ONLINE_STATE)
					{				
						if( (!GetDMCflag(DMC_RATE)) || (!GetDMCflag(DMC_EXE_MODE)) )	
						{
							SetDMCflag(DMC_RATE,DMC_RATE);						
							SetDMCflag(DMC_STOW | DMC_PILOT_WINDOW | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG ,0); 																									

							SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);
							if(GetDMCflag(DMC_OSD_ON))
							{										
								Set_OSD_Titel(1);			
								cpPutMessage(UART1_BASE,0x10,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);  
							}
							
						}
						
					}					
				}

			break;
			#endif
			
			
			default:

			break;


		}	
	
}

#ifdef AGC_SENS
void UavLongitude(unsigned char* msg)
{
	unsigned short cmd;
	unsigned short idx = 1;
	unsigned short i = 0;

	//mode = (msg[6] & 0x0F);
		
	for(i=1;i<8;i++)
	{
			
		cmd = (msg[6] & idx);
		
		switch(cmd)
		{


			case 0x01: // AGC decrease

				if(cmd)
				{
					if(GetDMCmode() == ONLINE_STATE)
					{
						if(Sens_level-SensState[0] >= MINI_SENS_LEVEL) 								
						{
							Sens_level-=SensState[0];					
							LensZoomWrite.write = 0x21;	//	Buf[2]
							LensZoomWrite.data[0]=0x2;	//	Buf[3]
							LensZoomWrite.data[1]=Sens_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);
						}
						else
						{
							Sens_level = MINI_SENS_LEVEL;
							LensZoomWrite.write = 0x21;	//	Buf[2]
							LensZoomWrite.data[0]=0x2;	//	Buf[3]
							LensZoomWrite.data[1]=Sens_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);							
						}					
					}					
				}
				
			break;

			case 0x02: // AGC increase

				if(cmd)
				{
					if(GetDMCmode() == ONLINE_STATE)
					{				

						if(Sens_level+SensState[1] <= MAX_SENS_LEVEL)					
						{					
							Sens_level+=SensState[1];							
							LensZoomWrite.write = 0x21;			//	Buf[2]
							LensZoomWrite.data[0]=0x2;			//	Buf[3]
							LensZoomWrite.data[1]=Sens_level; 	//	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);
						}
						else
						{
							Sens_level = MAX_SENS_LEVEL;							
							memset(&LensZoomWrite.data,0,13);		
							LensZoomWrite.write = 0x21;		 //	Buf[2]
							LensZoomWrite.data[0]=0x2;		 //	Buf[3]
							LensZoomWrite.data[1]=Sens_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);		
							
						}
					
					}									
				}
				
			break;
			


			case 0x03: // AGC decrease

				if(cmd)
				{
					if(GetDMCmode() == ONLINE_STATE)
					{
						if(Agc_level-GainLevelState[2] >= MINI_AGC_LEVEL) 								
						{
							Agc_level-=GainLevelState[2];					
							LensZoomWrite.write = 0x21;	//	Buf[2]
							LensZoomWrite.data[0]=0x1;	//	Buf[3]
							LensZoomWrite.data[1]=Agc_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);
						}
						else
						{
							Agc_level = MINI_AGC_LEVEL;
							LensZoomWrite.write = 0x21;	//	Buf[2]
							LensZoomWrite.data[0]=0x1;	//	Buf[3]
							LensZoomWrite.data[1]=Agc_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);							
						}					
					}					
				}
				
			break;

