EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_Mintron/Interpret.c
			case 0x04: // AGC increase

				if(cmd)
				{
					if(GetDMCmode() == ONLINE_STATE)
					{				

						if(Agc_level+GainLevelState[3] <= MAX_AGC_LEVEL)					
						{					
							Agc_level+=GainLevelState[3];							
							LensZoomWrite.write = 0x21;	//	Buf[2]
							LensZoomWrite.data[0]=0x1;	//	Buf[3]
							LensZoomWrite.data[1]=Agc_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);
						}
						else
						{
							Agc_level = MAX_AGC_LEVEL;							
							memset(&LensZoomWrite.data,0,13);		
							LensZoomWrite.write = 0x21;
							LensZoomWrite.data[0]=0x1;	//	Buf[3]
							LensZoomWrite.data[1]=Agc_level; //	Buf[4]								
							memset(&LensZoomWrite.data[2],0,11);
							cpPutMessage(UART1_BASE,0x1A,sizeof(LensZoomWrite),(unsigned char *)&LensZoomWrite);		
							
						}
					
					}									
				}
				
			break;

			default:

			break;
			
			}
		
			idx<<=1;	
		
		}
}
#endif

void	UAV_Altitude_above_MSL(unsigned char* msg)
{
//float UAV_Altitude;
 //erez   who  is MSB        float
//	UAV_Altitude = (int)((msg[12]<<24) & 0xFF000000);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[12],UAV_Altitude);

//	UAV_Altitude = (int)((msg[13]<<16) & 0xFF0000);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[13],UAV_Altitude);

//	UAV_Altitude = (int)((msg[14]<<8) & 0xFF00);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[14],UAV_Altitude);

//	UAV_Altitude = (int)((msg[15]<<8) & 0xFF00);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[15],UAV_Altitude);

//	UAV_Altitude = (float)((int)(msg[15]) + (int)(msg[14]<<8) + (int)(msg[13]<<16) + (int)(msg[12]<<24)) ;

//	printf("Interpret - UAV_Altitude_above_MSL = %08X %f \n",UAV_Altitude,UAV_Altitude);
}

void 	Ground_Height_above_MSL(unsigned char* msg)
{
  	//int cmd;
 	//cmd = (msg[4] & 0x0F);
}


void 	UAV_Body_Azimuth(unsigned char* msg)
{
//int body_azimuth;

	//body_azimuth = (int)((int)(msg[10]<<8) +  msg[9]);

	//printf("Interpret - UAV_Body_Azimuth=%d  \n",body_azimuth);
}

void 	Ground_Speed()
{
	//printf("Interpret - Ground_Speed()@%d \n",__LINE__);
}

void 	Target_Latitude()
{
	//printf("Interpret - Target_Latitude()@%d \n",__LINE__);
}
void Target_Longitude()
{
	//printf("Interpret - Target_Longitude()@%d \n",__LINE__);
}
void 	Target_Altitude_above_MSL(unsigned char* msg)   //8
{
//int trg_alt_MSL ;
//char   tempString[9];
//erez  who MSB ?
	//trg_alt_MSL = (int)((int)(msg[13]<<8) +  msg[12]);
//	printf(" %x %x \n",input_data_com0[10]<<8,input_data_com0[9]);
//	sprintf(tempString, "%d%%", trg_alt_MSL);
//    drawText(tempString, 10, 20); 
	//printf("Interpret - Target_Altitude_above_MSL = %d \n",trg_alt_MSL);

}

void Dial_Address(unsigned char* msg)
{
	 //erez   who MSB		 float
	//	UAV_longitude = (float)((int)(input_data_com0[15]) + (int)(input_data_com0[14]<<8) + (int)(input_data_com0[13]<<16) + (int)(input_data_com0[12]<<24) );
	//	printf("Interpret - UavLongitude = %f \n",UAV_longitude);
		
}

void LOS_Roll(void)
{

	float Los_Roll = Phic;//(Phic * RAD2DEG);
	//Los_Roll *= BEYOND2PIX;
	memcpy(&g_sendBuffer[14],&Los_Roll,sizeof(float));
}

void LOS_Pitch(void)
{

	float LOSPitch = Thetac;//(Thetac* RAD2DEG);
	//LOSPitch *= BEYOND2PIX;
	memcpy(&g_sendBuffer[14],&LOSPitch,sizeof(float));

}

// Interpreting the data of the correlator
void InterpretCorrelatorMode(unsigned char *bdData1)
{

	char CheckingCorr = (bdData1[11] & CHECKING_CORR_NUMBER)>>4;      // ORG  Nissim	
//	char CheckingCorr = (bdData1[8] & CHECKING_CORR_NUMBER)>>4;      // ORG  Nissim


	if(GetDMCflag(DMC_ENGINE_CONNECT))
	{
		SensorDebounce(bdData1);	//-- fill up majority table	
		UavLatitude(bdData1);
		#ifdef AGC_SENS
		//GainDebounce(bdData1);	//-- fill up majority table			
		UavLongitude(bdData1);
		#endif
	    ctrl.main_count++;

		
	    if ( (ctrl.main_count & 3) == 0 )  //-- write outputs
	    {				   
			Osd_Show(bdData1);			 //-- check overlay state
	    }
		#if 0
	    else
	    if ( (ctrl.main_count & 3) == 1 )  //-- read inputs
	    {	            
	        Mark_Show(bdData1);
	    }
		#endif
		
	}

			memset(&g_sendBuffer[0],0,20);

			if ( CheckingCorr == UAV_LATITUDE)					// 0
			{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
			}
			else if ( CheckingCorr == UAV_LONGITUDE)			// 1
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == UAV_ALTITUDE_ABOVE_MSL)	// 2
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == GROUND_HEIGHT_ABOVE_MSL)	// 3 
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == UAV_BODY_AZIMUTH) 		// 4
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
					LOS_Roll();
				}
			else if ( CheckingCorr == GROUND_SPEED) 			// 5
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
					LOS_Pitch();
				}
			else if ( CheckingCorr == TARGET_LATITUDE)			//6
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == TARGET_LONGITUDE) 		// 7
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == TARGET_ALTITUDE_ABOVE_MSL) // 8
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == DIAL_ADDRESS) 			//9
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == ELEVATION_GIMBAL_ANGLE)	// 10
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE11)			//6
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE12) 		// 7
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE13) // 8
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE14) 			//9
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE14)	// 10
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}

}



void InterpretCmd(void)
{

		InterpretCmdMode(cpGetMessage(COM0));		
		InterpretCorrelatorMode(cpGetMessage(COM0));						
		ReportData();
}
